---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyReference
source: html/d64bfb95-2ab5-dd3b-6a0e-fee9d2affa5d.htm
---
# AssetPropertyReference Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.